<%-- 
    Document   : start
    Created on : 28 мая 2024 г., 13:00:15
    Author     : username
--%>

<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Раз</title>
</head>
<body>
    <h1>Стартовая страница</h1>
    <p>п5 п6 п7 п8 п9
   52 = 1 1  0  1  00

1. В зависимости от варианта выполняется разработка web-приложения. Пример
приложения похожего на то, которое нужно разработать, см. выше. Показать работу
приведённого выше примера.
2. В целом, нужно создать web-приложение в NetBeans IDE, которое должно состоять
из трёх JSP-страниц – стартовой, главной и финишной, а также при необходимости
использовать для обмена данными между страницами Bean-компоненту.
3. На «Главной странице» инициировать вычисление функции - Дана последовательность целых чисел. Найти произведение только тех из них, которые
больше заданного числа М. Если таких чисел нет, то вывести сообщение об этом
4. Параметры необходимые для работы функции реализуемой на «Главной странице»
задавать на ней в текстовом поле, а результат её работы показывать на «Финишной
странице».
5. Программный код вычисляемой функции разместить: 1 –
в классе Bean-компоненты.
6. Заголовки страниц должны иметь следующий вид: 1 - «Раз», «Два» и «Три».
7. Формат «Стартовой страницы»: 0 – содержит текст задания на лабораторную работу,
ФИО студента и ссылку для перехода на «Главную страницу»
8. Организовать вывод результатов работы функции на «Финишной странице»: 1 – результаты должны быть каким-то
образом размещены в видимой таблице, в таблице допускается произвольное число
столбцов и строк.
9. При повторном переходе на «Главную страницу», например при нажатии кнопки
«Возврат» на «Финишной странице», на «Главной странице» должно отображаться:
0 – изменение триггера, размещённого в Bean-компоненте
10. Среди средств автоматизации разработки web-приложения можно выделить
инструмент окно «Палитра» для JSP – страниц и средства реорганизации кода для
класса bean-компоненты, см. рисунки выше.</p>
    <p>ФИО студента: Лучников Ростислав Игоревич</p>
    <a href="main.jsp">Перейти на главную страницу</a>
</body>
</html>
